app/controllers/phones_controller.rb

  def index
   @phones = Phone.all
---
SELECT * FROM `phones`

  def show
    @phone = Phone.find(params[:id])
---
SELECT * FROM `phones` WHERE (`phones`.`id` = 1)

  def edit
    @phone = Phone.find(params[:id])
---
SELECT * FROM `phones` WHERE (`phones`.`id` = 1)

  def create
    @phone = Phone.new(params[:phone])

    respond_to do |format|
      if @phone.save
---
INSERT INTO `phones` (`name`, `phone_no2`, `updated_at`, `phone_no1`, `address`, `created_at`) VALUES('arvind janvekar', '9657473608', '2010-06-23 05:10:35', '9960549395', 'kolhapur.', '2010-06-23 05:10:35')

  def update
    @phone = Phone.find(params[:id])

    respond_to do |format|
      if @phone.update_attributes(params[:phone])
---
SELECT * FROM `phones` WHERE (`phones`.`id` = 1)
UPDATE `phones` SET `address` = 'pune.', `phone_no2` = '1234567890', `phone_no1` = '4563217894', `updated_at` = '2010-06-23 11:12:10' WHERE `id` = 15

  def destroy
    @phone = Phone.find(params[:id])
    @phone.destroy
---
SELECT * FROM `phones` WHERE (`phones`.`id` = 6)
DELETE FROM `phones` WHERE `id` = 6

def showsearch123
     puts"=========================="
     @a1=params[:asd]
     puts @a1
      puts"=========================="
     @p=Phone.find(:first,:conditions => "name = '#{params[:asd]}'")
---
SELECT * FROM `phones` WHERE (phone_no1 = '9960549395') LIMIT 1