app/controllers/phone1_controller.rb

    def showsearch123
     puts"=========================="
     @a1=params[:asd]
     puts @a1
     if phone.phone_no1 == params[:asd]
     @p=Phone.find(:first,:conditions => "phone_no1 = '#{params[:asd]}'")
---
SELECT * FROM `phones` WHERE (phone_no1 = '9960549395') LIMIT 1